<a href="https://colab.research.google.com/github/Data-Intelligence-Mastery/data_science_interview_questions/blob/master/Q009_shoe_price_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Shoe prices

*SQL, Database Querying, Update Function*


Suppose you are given a SQL table containing the brands of shoes (field name: brand) as well as the shoe price (field name: price). The database is called shoe_info. You are tasked with updating the prices in this database for a few brands of shoes. Specifically, you have been asked to update all Nike shoe prices to 100 dollars, and all Adidas shoe prices to 85 dollars. Using SQL, write a query to perform this action.

First let's create a draft database from a dataframe.

In [1]:
import pandas as pd

shoe_info = {'Brand':['Nike', 'Adidas', 'Nike', 'Adidas', 'Nike', 'Converse', 'Skechers'], 
             'Price':[95, 94, 90, 97, 90, 87, 76]}

shoe_info = pd.DataFrame(shoe_info)
shoe_info

      Brand  Price
0      Nike     95
1    Adidas     94
2      Nike     90
3    Adidas     97
4      Nike     90
5  Converse     87
6  Skechers     76

Check all data in dataframe.

In [2]:
import sqlite3

conn = sqlite3.connect('shoe_info.db')
c = conn.cursor()

c.execute('CREATE TABLE SHOE_INFO (Brand text, Price number)')
conn.commit()

shoe_info.to_sql('SHOE_INFO', conn, if_exists='replace', index=True)
c.execute('''
  SELECT * FROM SHOE_INFO
  ''')

for row in c.fetchall():
  print(row)

(0, 'Nike', 95)
(1, 'Adidas', 94)
(2, 'Nike', 90)
(3, 'Adidas', 97)
(4, 'Nike', 90)
(5, 'Converse', 87)
(6, 'Skechers', 76)

Check 'Nike' shoe prices.

In [3]:
c.execute('''
  SELECT * FROM SHOE_INFO
  WHERE Brand = 'Nike'
  ''')
for row in c.fetchall():
  print (row)

(0, 'Nike', 95)
(2, 'Nike', 90)
(4, 'Nike', 90)

Update 'Nike' and 'Adidas' prices and check afterwards.

In [12]:
c.execute('''
  UPDATE SHOE_INFO
  SET Price = 100
  WHERE Brand = 'Nike'
  ''')

c.execute('''
  UPDATE SHOE_INFO
  SET Price = 85
  WHERE Brand = 'Adidas'
  ''')

c.execute('''
  SELECT * FROM SHOE_INFO
  ''')

for row in c.fetchall():
  print(row)

(0, 'Nike', 100)
(1, 'Adidas', 85)
(2, 'Nike', 100)
(3, 'Adidas', 85)
(4, 'Nike', 100)
(5, 'Converse', 87)
(6, 'Skechers', 76)